#pragma once

#define  RELEASE_VERSION
/***************************************************************
** 参数：
**  url[in]
**      服务器地址可以用;隔开配置多个
**	starttype[in]
**		启动类型详细见SGP.h定义
**
** 返回值：
**  成功 TRUE
**
** 说明：
**   启动保护
***************************************************************/
BOOL StartProtect(char * url, DWORD starttype);

/***************************************************************
** 参数：
**  ProcessId[in]
**      被保护进程id
**	Client[in]
**		是否是客户端，1为客户端，用于识别
**
** 返回值：
**  成功 TRUE
**
** 说明：
**   添加需要保护的进程
***************************************************************/
BOOL AddProtectProcess(ULONG ProcessId, ULONG Client);

/***************************************************************
** 参数：
**  hWnd[in]
**      被保护窗口句柄
** 返回值：
**  成功 TRUE
**
** 说明：
**   添加需要保护的窗口
***************************************************************/
BOOL ADdProtectWindow(HWND hWnd);

/***************************************************************
** 参数：
**  buff[in]
**      加密缓冲区
**
**	length[in]
**		加密长度
**
** 返回值：
**  成功 TRUE
**
** 说明：
**   用于服务器通信校验用加密
***************************************************************/
BOOL EncryptPackage(PBYTE buff, SIZE_T length);

/***************************************************************
** 参数：
**  Account[in]
**      帐号
**
**	AccountId[in]
**		帐号数字ID
**
**	Charactor[in]
**		角色名
**
**	Game[in]
**		游戏名识别
**
**	Area[in]
**		游戏区
**
** 返回值：
**  成功 TRUE
**
** 说明：
**   用于保存游戏登录数据
***************************************************************/
BOOL SaveUserInfo(
	const char* Account,
	const char* AccountId,
	const char* Charactor,
	const char* Game,
	const char* Area);

BOOL IsRunning();

/***************************************************************
**
** 返回值：
**  成功 TRUE
**
** 说明：
**   强制结束所有进程用于发现作弊后退出
***************************************************************/
BOOL TerminateAll();

/***************************************************************
** 参数：
**  cheattype[in]
**      自定义作弊类型
**
** 返回值：
**  成功 TRUE
**
** 说明：
**   提交作弊信息反馈到反外挂服务器，自定义类型
***************************************************************/
BOOL CommitCheatInfo(int cheattype);


BOOL SetKey(int index);